package org.example.util;

public class StringProvider {
    public static String getString() {
        String content = "데이터베이스란 무엇인지 간략하게 설명하시오.\n" +
                "엔티티란 무엇인지 간략하게 설명하시오.\n" +
                "약한 엔티티와 강한 엔티티의 차이는 무엇인가요?\n" +
                "릴레이션은 무엇인가요?\n" +
                "속성(attribute)를 간단하게 설명해보세요.\n" +
                "도메인(domain)을 간단하게 설명해보세요.\n" +
                "필드와 레코드, 튜플에 대해 간단히 설명하시오.\n" +
                "필드 타입 중 날짜 타입의 예시는 무엇이 있나요?\n" +
                "필드 타입 중 문자 타입의 예시는 무엇이 있나요?\n" +
                "대용량 데이터를 저장하기 위한 타입에는 무엇이 있나요?\n" +
                "기본키에 대해 간략히 설명하시오.\n" +
                "자연키에 대해 간략히 설명하시오.\n" +
                "인조키에 대해 간략히 설명하시오.\n" +
                "외래키에 대해 간략히 설명하시오.\n" +
                "후보키에 대해 간략히 설명하시오.\n" +
                "대체키에 대해 간략히 설명하시오.\n" +
                "슈퍼키에 대해 간략히 설명하시오.\n" +
                "ERD에 대해 간략히 설명하시오.\n" +
                "정규화는 무엇인가요?\n" +
                "제1정규형을 설명해보세요.\n" +
                "제2정규형을 설명해보세요.\n" +
                "제3정규형을 설명해보세요.\n" +
                "보이스/코드 정규형을 설명해보세요.\n" +
                "ACID라고 부르는 트랜잭션의 특성 4가지는 각각 무엇인가요?\n" +
                "트랜잭션의 4가지 특징 중 하나, 원자성에 대해 간략히 설명하시오.\n" +
                "트랜잭션 전파에 대해 간략히 설명하시오.\n" +
                "트랜잭션의 4가지 특징 중 하나, 일관성에 대해 간략히 설명하시오.\n" +
                "트랜잭션의 4가지 특징 중 하나, 격리성에 대해 간략히 설명하시오.\n" +
                "격리 수준에는 어떤 것들이 있나요?\n" +
                "격리 수준에 따라 발생하는 현상에는 무엇들이 있나요?\n" +
                "팬텀 리드에 대해 간략히 설명하시오.\n" +
                "반복 가능하지 않은 조회(non-repeatable-read)를 간략히 설명하시오.\n" +
                "더티 리드에 대해 간략히 설명하시오.\n" +
                "SERIALIZABLE 격리 수준을 간략히 설명하시오.\n" +
                "REPEATABLE_READ 격리 수준을 간략히 설명하시오.\n" +
                "READ_COMMITTED 격리 수준을 간략히 설명하시오.\n" +
                "READ_UNCOMMITTED 격리 수준을 간략히 설명하시오.\n" +
                "트랜잭션의 4가지 특징 중 하나, 지속성에 대해 간략히 설명하시오.\n" +
                "데이터베이스 무결성에는 어떤 것들이 있나요?\n" +
                "관계형으로 구성된 DBMS는 어떤 것들이 있나요?\n" +
                "PostgreSQL이 무언지 간략히 설명하시오.\n" +
                "관계형이 아닌 DBMS는 무엇이 있나요?\n" +
                "MongoDB에 대해 간략히 설명하시오.\n" +
                "redis에 대해 간략히 설명하시오.\n" +
                "인덱스가 무언지 간략히 설명하시오.\n" +
                "인덱스를 구성하는 자료구조는 무엇인지 설명하시오.\n" +
                "인덱스를 사용하는 이유는 무엇인가요?\n" +
                "MySQL에서 인덱스를 만드는 방법은 무엇인가요\n" +
                "MongoDB에서 인덱스를 만드는 방법은 무엇인가요?\n" +
                "인덱스를 최적화하는 방법에 대해 설명해보시오.\n" +
                "데이터베이스에서 조인이란 무엇인가요?\n" +
                "내부 조인에 대해 간략히 설명하시오.\n" +
                "Left outer join에 대해 간략히 설명하시오.\n" +
                "Right outer join에 대해 간략히 설명하시오.\n" +
                "Full outer  join에 대해 간략히 설명하시오.\n" +
                "중첩 루프 조인에 대해 간략히 설명하시오.\n" +
                "정렬 병합 조인에 대해 간략히 설명하시오.\n" +
                "해시 조인이 무언지 설명하시오.\n";
        return content;
    }
}
